holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.h
/** -------------------------------------------------------------------------------------
 * 
 */

#ifndef SATIO_LVGL_H
#define SATIO_LVGL_H

#include "lvgl.h"

#include "bsp/esp32_p4_wifi6_touch_lcd_xc.h"
#include <limits.h>
#include "esp_log.h"
#include "lvgl.h"
// #include "./strval.h"
#include <stdlib.h>       // malloc/free
#include "ff.h"           // FatFs core
#include "diskio.h"       // Disk I/O
#include "diskio_impl.h"  // ESP32 disk impl
#include "esp_vfs_fat.h"  // VFS integration
#include "sdmmc_cmd.h"
#include "driver/sdmmc_host.h"
#include "esp_err.h"
#include "sd_pwr_ctrl_by_on_chip_ldo.h"
#include <stdio.h>
#include <dirent.h>
#include "bsp/esp-bsp.h"

#include <stdio.h>
#include <limits.h>
#include <string.h>
// #include <iostream>
#include <assert.h>
#include <float.h>
#include <math.h>
#include <Arduino.h>
// #include <Wire.h>

#include "./config.h"
#include "./REG.h"
#include "./strval.h"
#include "./meteors.h"
#include "./wtgps300p.h"
#include "./wt901.h"
#include "./multiplexers.h"
#include "./sidereal_helper.h"
#include "./hextodig.h"
#include "./ins.h"
#include "./satio.h"
#include "./custommapping.h"
#include "./matrix.h"
#include "./serial_infocmd.h"
#include "./system_data.h"
#include "./sdcard_helper.h"
#include "./task_handler.h"
// #include "./multi_display_controller.h"
#include "./i2c_helper.h"
#include "./wit_c_sdk.h"
#include "./astroclock.h"

#include <sys/time.h>
#include <rtc_wdt.h>
#include <esp_task_wdt.h>
#include "esp_pm.h"
#include "esp_attr.h"
#include "esp_log.h"
#include "esp_partition.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_partition.h"
#include "esp_spiffs.h"
#include "esp_heap_caps.h"
#include "nvs_flash.h"
#include "esp_system.h"
#include "driver/uart.h"

/* Enable complex draw engine (required for anti-aliasing) */
#define LV_USE_DRAW_SW              1

#if LV_USE_DRAW_SW
    /* Enable complex shapes (arcs, lines, polygons, etc.) */
    #define LV_DRAW_SW_COMPLEX      1
    
    /* Set to 1 to enable anti-aliasing */
    #define LV_DRAW_SW_ASM          LV_DRAW_SW_ASM_NONE
#endif

// LV_FONT_DECLARE(active_space_10);
// LV_FONT_DECLARE(space_ranger_15);
LV_FONT_DECLARE(cobalt_alien_17);
// LV_FONT_DECLARE(space_ranger_19);
// LV_FONT_DECLARE(space_ranger_21);
// LV_FONT_DECLARE(space_ranger_23);
LV_FONT_DECLARE(cobalt_alien_25);

#define LV_TXT_ALPHA_LC "abcdefghijklmnopqrstuvwxyz"
#define LV_TXT_ALPHA_UC "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
#define LV_TXT_NUM      "0123456789"
#define LV_TXT_NUMDEC  "0123456789.-"
#define LV_TXT_ALNUMDEC "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789.-"

typedef struct {
    lv_obj_t * panel; // Main container panel
    lv_obj_t * label;
    lv_obj_t * button;
} button_t;

/** ---------------------------------------------------------------------------------------
 * @brief System Tray Struct
 * 
 * @param tray Pointer to the clickable tray bar object (top-right, no icons).
 * @param panel Pointer to the dropdown panel object.
 * @param slider Pointer to the brightness slider object.
 * @param is_open Boolean flag indicating whether the system tray is currently open or closed.
 */
typedef struct {
    lv_obj_t * tray;     // Clickable tray bar (top-right, no icons)
    lv_obj_t * panel;    // Dropdown panel  
    bool is_open;
    lv_obj_t * slider_brightness;
    lv_obj_t * local_time;
    lv_obj_t * local_date;
    lv_obj_t * human_date;

    // Indicators
    lv_obj_t * datetime_sync; // SYN
    lv_obj_t * serial_cmommand_enabled; // CMD
    lv_obj_t * gps_signal_strength; // SIG
    lv_obj_t * sdcard_mounted; // SD

    // System tray menu
    lv_obj_t * grid_menu_1;

} system_tray_t;

/** ---------------------------------------------------------------------------------------
 * Title Bar Struct
 */
typedef struct {
    lv_obj_t * panel; // The title bar object

    // datetime
    lv_obj_t * time_label; // Label to display local time
    lv_obj_t * date_label; // Label to display local date

    // Indicators
    lv_obj_t * datetime_sync; // SYN
    lv_obj_t * serial_cmommand_enabled; // CMD
    lv_obj_t * gps_signal_strength; // SIG
    lv_obj_t * sdcard_mounted; // SD
} title_bar_t;

/** ----------------------------------------------------------------------------------------
 * @brief Structure to hold image data from SD card and associated LVGL objects for display.
 * 
 * This structure allows us to keep track of the PSRAM pointer, file size, LVGL image object, 
 * and descriptor together.
 */
typedef struct {
    uint32_t f_size;
    uint8_t * bytes_in_psram;
    lv_obj_t * lv_image_obj;
    lv_image_dsc_t dsc;
} sdcard_image_t;

/** ---------------------------------------------------------------------------------------
 * @brief Keyboard Struct
 * 
 * @param kb Pointer to the LVGL keyboard object.
 * @param ta Pointer to the LVGL textarea object associated with the keyboard.
 */

typedef struct {
    lv_obj_t * kb;
    lv_obj_t * ta;
} keyboard_t;

/** ---------------------------------------------------------------------------------------
 * @brief Menu Struct
 * 
 * @param main_header Pointer to the main header object of the menu.
 * @param back_button Pointer to the back button object of the menu.
 * @param back_label Pointer to the label object of the back button.
 * @param menu Pointer to the menu object.
 * @param pages Pointer to an array of page objects in the menu.
 * @param max_pages The maximum number of pages allocated for the menu.
 * @param page_count The current number of pages in the menu.
 * @param page_items Pointer to a 2D array of item objects for each page in the menu.
 * @param page_item_counts Pointer to an array that holds the count of items for each page in the menu.
 * @param max_items_per_page The maximum number of items allocated for each page in the menu.
 */
typedef struct {
    lv_obj_t *   main_header;
    lv_obj_t *   back_button;
    lv_obj_t *   back_label;
    lv_obj_t *   menu;
    lv_obj_t **  pages;
    int          max_pages;
    int          page_count;
    lv_obj_t *** page_items;
    uint32_t *   page_item_counts;
    uint32_t     max_items_per_page;
} menu_struct;

/** ---------------------------------------------------------------------------------------
 * @brief Matrix Function Container Struct
 * 
 * Container for displaying and editing matrix function parameters.
 */
typedef struct {
    lv_obj_t * panel;                    // Main container panel

