holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.h
    // Switch selection
    lv_obj_t * label_switch_index_select;   // Function index select label
    lv_obj_t * dd_switch_index_select;      // Matrix function index select

    // Function selection
    lv_obj_t * label_function_index_select; // Function index select label
    lv_obj_t * dd_function_index_select;    // Matrix function index select
    
    // Function info
    lv_obj_t * label_function_name;      // Function name label
    lv_obj_t * dd_function_name;         // Function name dropdown
    
    // XYZ values (textareas for input)
    lv_obj_t * label_x;                  // X label
    lv_obj_t * ta_x;                     // X textarea
    lv_obj_t * dd_x;
    lv_obj_t * label_mode_x;
    lv_obj_t * dd_mode_x;
    
    lv_obj_t * label_y;                  // Y label
    lv_obj_t * ta_y;                     // Y textarea
    lv_obj_t * dd_y;
    lv_obj_t * label_mode_y;
    lv_obj_t * dd_mode_y;
    
    lv_obj_t * label_z;                  // Z label
    lv_obj_t * ta_z;                     // Z textarea
    lv_obj_t * dd_z;
    lv_obj_t * label_mode_z;
    lv_obj_t * dd_mode_z;
    
    // Operator
    lv_obj_t * label_operator;           // Operator label
    lv_obj_t * dd_operator;              // Operator dropdown
    
    // Flux (textarea for input)
    lv_obj_t * label_flux;               // Flux label
    lv_obj_t * ta_flux;                  // Flux textarea
    
    // Output mode (dropdown)
    lv_obj_t * label_output_mode;        // Output mode label
    lv_obj_t * dd_output_mode;           // Output mode dropdown
    
    // PWM values (textareas for input)
    lv_obj_t * label_output_pwm_0;       // Output PWM label 0
    lv_obj_t * label_output_pwm_1;       // Output PWM label 1
    lv_obj_t * ta_pwm_0;                 // PWM 0 textarea
    lv_obj_t * ta_pwm_1;                 // PWM 1 textarea
    
    // Invert Function Logic
    lv_obj_t * label_inverted_logic;     // Inverted logic label
    lv_obj_t * dd_inverted_logic;        // Inverted logic switch
    
    // Map Slot
    lv_obj_t * label_map_slot;           // Map slot label
    lv_obj_t * dd_map_slot;              // Map slot dropdown

    // Port
    lv_obj_t * label_port_map;           // Port map label
    lv_obj_t * ta_port_map;              // Port map textarea

    button_t matrix_switch_computer_assist;
    button_t matrix_switch_override;
    lv_obj_t * matrix_switch_output_value;
    
} matrix_function_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief Matrix Mapping Configuration Container Struct
 */
typedef struct {
    lv_obj_t * panel; // Main container panel
    lv_obj_t * slot;
    lv_obj_t * dd_slot;
    lv_obj_t * c0;
    lv_obj_t * dd_c0;
    lv_obj_t * c1;
    lv_obj_t * ta_c1;
    lv_obj_t * c2;
    lv_obj_t * ta_c2;
    lv_obj_t * c3;
    lv_obj_t * ta_c3;
    lv_obj_t * c4;
    lv_obj_t * ta_c4;
    lv_obj_t * c5;
    lv_obj_t * ta_c5;
    lv_obj_t * mode;
    lv_obj_t * dd_mode;
    lv_obj_t * input_value;
    lv_obj_t * value_input;
    lv_obj_t * map_result;
    lv_obj_t * value_map_result;
} mapping_config_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief GNGGA Container Struct
 */
typedef struct {
    lv_obj_t * panel; // Main container panel
    lv_obj_t * lbl_utc_time;
    lv_obj_t * val_utc_time;
    lv_obj_t * lbl_latitude;
    lv_obj_t * val_latitude;
    lv_obj_t * lbl_longitude;
    lv_obj_t * val_longitude;
    lv_obj_t * lbl_solution_status;
    lv_obj_t * val_solution_status;
    lv_obj_t * lbl_sat_count;
    lv_obj_t * val_sat_count;
    lv_obj_t * lbl_gps_precision_factor;
    lv_obj_t * val_gps_precision_factor;
    lv_obj_t * lbl_altitude;
    lv_obj_t * val_altitude;
    lv_obj_t * lbl_geoidal;
    lv_obj_t * val_geoidal;
    lv_obj_t * lbl_differential_delay;
    lv_obj_t * val_differential_delay;
    lv_obj_t * lbl_bad_element_count;
    lv_obj_t * val_bad_element_count;
} gngga_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief GNRMC Container Struct
 */
typedef struct {
    lv_obj_t * panel; // Main container panel
    lv_obj_t * lbl_utc_time;
    lv_obj_t * val_utc_time;
    lv_obj_t * lbl_positioning_status;
    lv_obj_t * val_positioning_status;
    lv_obj_t * lbl_latitude;
    lv_obj_t * val_latitude;
    lv_obj_t * lbl_longitude;
    lv_obj_t * val_longitude;
    lv_obj_t * lbl_ground_speed;
    lv_obj_t * val_ground_speed;
    lv_obj_t * lbl_ground_heading;
    lv_obj_t * val_ground_heading;
    lv_obj_t * lbl_utc_date;
    lv_obj_t * val_utc_date;
    lv_obj_t * lbl_installation_angle;
    lv_obj_t * val_installation_angle;
    lv_obj_t * lbl_installation_angle_direction;
    lv_obj_t * val_installation_angle_direction;
    lv_obj_t * lbl_mode_indication;
    lv_obj_t * val_mode_indication;
    lv_obj_t * lbl_bad_element_count;
    lv_obj_t * val_bad_element_count;
} gnrmc_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief GPATT Container Struct
 */
typedef struct {
    lv_obj_t * panel; // Main container panel
    lv_obj_t * lbl_pith;
    lv_obj_t * val_pitch;
    lv_obj_t * lbl_roll;
    lv_obj_t * val_roll;
    lv_obj_t * lbl_yaw;
    lv_obj_t * val_yaw;
    lv_obj_t * lbl_software_version;
    lv_obj_t * val_software_version;
    lv_obj_t * lbl_product_id;
    lv_obj_t * val_product_id;
    lv_obj_t * lbl_ins;
    lv_obj_t * val_ins;
    lv_obj_t * lbl_hardware_version;
    lv_obj_t * val_hardware_version;
    lv_obj_t * lbl_run_state_flag;
    lv_obj_t * val_run_state_flag;
    lv_obj_t * lbl_mis_angle_num;
    lv_obj_t * val_mis_angle_num;
    lv_obj_t * lbl_static_flag;
    lv_obj_t * val_static_flag;
    lv_obj_t * lbl_user_code;
    lv_obj_t * val_user_code;
    lv_obj_t * lbl_gst_data;
    lv_obj_t * val_gst_data;
    lv_obj_t * lbl_line_flag;
    lv_obj_t * val_line_flag;
    lv_obj_t * lbl_mis_att_flag;
    lv_obj_t * val_mis_att_flag;
    lv_obj_t * lbl_imu_kind;
    lv_obj_t * val_imu_kind;
    lv_obj_t * lbl_ubi_car_kind;
    lv_obj_t * val_ubi_car_kind;
    lv_obj_t * lbl_mileage;
    lv_obj_t * val_mileage;
    lv_obj_t * lbl_run_inetial_flag;
    lv_obj_t * val_run_inetial_flag;
    lv_obj_t * lbl_speed_num;
    lv_obj_t * val_speed_num;
    lv_obj_t * lbl_scalable;
    lv_obj_t * val_scalable;
    lv_obj_t * lbl_bad_element_count;
    lv_obj_t * val_bad_element_count;
} gpatt_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief SATIO Container Struct
 */
typedef struct {
    lv_obj_t * panel; // Main container panel
    lv_obj_t * lbl_local_yday;
    lv_obj_t * val_local_yday;
    lv_obj_t * lbl_local_wday_name;
    lv_obj_t * val_local_wday_name;
    lv_obj_t * lbl_local_month_name;
    lv_obj_t * val_local_month_name;
    lv_obj_t * lbl_formatted_local_time;
    lv_obj_t * val_formatted_local_time;
    lv_obj_t * lbl_formatted_local_date;
    lv_obj_t * val_formatted_local_date;
    lv_obj_t * lbl_local_unixtime_us;
    lv_obj_t * val_local_unixtime_us;
    lv_obj_t * lbl_formatted_rtc_sync_time;
    lv_obj_t * val_formatted_rtc_sync_time;
    lv_obj_t * lbl_formatted_rtc_sync_date;
    lv_obj_t * val_formatted_rtc_sync_date;
    lv_obj_t * lbl_rtcsync_latitude;
    lv_obj_t * val_rtcsync_latitude;
    lv_obj_t * lbl_rtcsync_longitude;
    lv_obj_t * val_rtcsync_longitude;
    lv_obj_t * lbl_rtcsync_altitude;
    lv_obj_t * val_rtcsync_altitude;
    lv_obj_t * lbl_formatted_rtc_time;
    lv_obj_t * val_formatted_rtc_time;
    lv_obj_t * lbl_formatted_rtc_date;
    lv_obj_t * val_formatted_rtc_date;
    lv_obj_t * lbl_rtc_unixtime;
    lv_obj_t * val_rtc_unixtime;
    lv_obj_t * lbl_utc_second_offset;
    lv_obj_t * val_utc_second_offset;
    lv_obj_t * lbl_utc_auto_offset_flag;
    lv_obj_t * val_utc_auto_offset_flag;
    lv_obj_t * lbl_set_time_automatically;
    lv_obj_t * val_set_time_automatically;
    lv_obj_t * lbl_altitude;
    lv_obj_t * val_altitude;
    lv_obj_t * lbl_altitude_converted;
    lv_obj_t * val_altitude_converted;
    lv_obj_t * lbl_altitude_unit_mode;
    lv_obj_t * val_altitude_unit_mode;
    lv_obj_t * lbl_altitude_conversion_mode;
    lv_obj_t * val_altitude_conversion_mode;
    lv_obj_t * lbl_speed;
    lv_obj_t * val_speed;
    lv_obj_t * lbl_speed_converted;
    lv_obj_t * val_speed_converted;
    lv_obj_t * lbl_speed_unit_mode;
    lv_obj_t * val_speed_unit_mode;
    lv_obj_t * lbl_speed_conversion_mode;
    lv_obj_t * val_speed_conversion_mode;
    lv_obj_t * lbl_ground_heading_name;
    lv_obj_t * val_ground_heading_name;
    lv_obj_t * lbl_ground_heading;
    lv_obj_t * val_ground_heading;
    lv_obj_t * lbl_ground_heading_mode;
    lv_obj_t * val_ground_heading_mode;
    lv_obj_t * lbl_mileage;
    lv_obj_t * val_mileage;
} satio_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief GYRO Container Struct
 */
typedef struct {
    lv_obj_t * panel; // Main container panel
    
    lv_obj_t * lbl_gyro_0_ang_x;
    lv_obj_t * val_gyro_0_ang_x;
    lv_obj_t * lbl_gyro_0_ang_y;
    lv_obj_t * val_gyro_0_ang_y;
    lv_obj_t * lbl_gyro_0_ang_z;
    lv_obj_t * val_gyro_0_ang_z;
    
