holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.h
    lv_obj_t * lbl_gyro_0_acc_x;
    lv_obj_t * val_gyro_0_acc_x;
    lv_obj_t * lbl_gyro_0_acc_y;
    lv_obj_t * val_gyro_0_acc_y;
    lv_obj_t * lbl_gyro_0_acc_z;
    lv_obj_t * val_gyro_0_acc_z;
    
    lv_obj_t * lbl_gyro_0_gyr_x;
    lv_obj_t * val_gyro_0_gyr_x;
    lv_obj_t * lbl_gyro_0_gyr_y;
    lv_obj_t * val_gyro_0_gyr_y;
    lv_obj_t * lbl_gyro_0_gyr_z;
    lv_obj_t * val_gyro_0_gyr_z;
    
    lv_obj_t * lbl_gyro_0_mag_x;
    lv_obj_t * val_gyro_0_mag_x;
    lv_obj_t * lbl_gyro_0_mag_y;
    lv_obj_t * val_gyro_0_mag_y;
    lv_obj_t * lbl_gyro_0_mag_z;
    lv_obj_t * val_gyro_0_mag_z;
    
    lv_obj_t * lbl_gyro_0_current_uiBaud;
    lv_obj_t * val_gyro_0_current_uiBaud;
} gyro_0_container_t;

/** --------------------------------------------------------------------------------------- 
 * Function initializations.
*/

static void tray_close_ready_cb(lv_anim_t * a);
static void set_keyboard_context_cb(lv_event_t * e);
static void keyboard_event_cb(lv_event_t * e);
static void screen_swipe_cb(lv_event_t * e);
static void screen_tap_cb(lv_event_t * e);
void slider_brightness_event_cb(lv_event_t * e);
static void tray_close_ready_cb(lv_anim_t * a);
static void system_tray_grid_menu_1_event_cb(lv_event_t * e);
static void matrix_overview_grid_1_event_cb(lv_event_t * e);
static void dd_function_index_select_event_cb(lv_event_t * e);
static void dd_switch_index_select_event_cb(lv_event_t * e);
static void dd_current_map_slot_event_cb(lv_event_t * e);
static void dd_function_name_event_cb(lv_event_t * e);
static void dd_c0_event_cb(lv_event_t * e);
static void dd_mode_event_cb(lv_event_t * e);
static void dd_mode_x_event_cb(lv_event_t * e);
static void dd_mode_y_event_cb(lv_event_t * e);
static void dd_mode_z_event_cb(lv_event_t * e);
static void dd_inverted_logic_event_cb(lv_event_t * e);
static void dd_x_event_cb(lv_event_t * e);
static void dd_y_event_cb(lv_event_t * e);
static void dd_z_event_cb(lv_event_t * e);
static void dd_operator_event_cb(lv_event_t * e);
static void dd_output_mode_event_cb(lv_event_t * e);
static void dd_matrix_file_slot_select_event_cb(lv_event_t * e);
static void dd_link_map_slot_event_cb(lv_event_t * e);
static void matrix_new_event_cb(lv_event_t * e);
static void matrix_save_event_cb(lv_event_t * e);
static void matrix_load_event_cb(lv_event_t * e);
static void matrix_delete_event_cb(lv_event_t * e);
static void current_matrix_computer_assist_event_cb(lv_event_t * e);
static void switch_matrix_mapping_panel_event_cb(lv_event_t * e);
static void current_matrix_override_off_event_cb(lv_event_t * e);
static void switch_gps_panel_event_cb(lv_event_t * e);

system_tray_t create_system_tray(lv_obj_t * scr);

title_bar_t create_title_bar (
    lv_obj_t * scr,
    int32_t size_w_px,
    int32_t size_h_px,
    lv_align_t alignment,
    int32_t pos_x,
    int32_t pos_y,
    bool show_scrollbar,
    bool enable_scrolling
    );

lv_obj_t * create_slider(
    lv_obj_t * scr,
    int32_t size_w_px,
    int32_t size_h_px,
    lv_align_t alignment,
    int32_t pos_x,
    int32_t pos_y,
    int32_t range_min,
    int32_t range_max,
    int32_t range_value
    );

lv_obj_t * create_label(
    lv_obj_t * scr,
    int32_t size_w_px,
    int32_t size_h_px,
    lv_align_t alignment,
    int32_t pos_x,
    int32_t pos_y,
    char * text,
    lv_text_align_t text_align,
    const lv_font_t * font,
    bool transparent_bg,
    bool show_scrollbar,
    bool enable_scrolling,
    int32_t outline_width,
    int32_t radius,
    int32_t expected_number_of_lines=1
    );

lv_obj_t * create_textarea(
    lv_obj_t * scr,
    int32_t size_w_px,
    int32_t size_h_px,
    lv_align_t alignment,
    int32_t pos_x,
    int32_t pos_y,
    bool one_line,
    char * accepted_chars,
    char * placeholder_text,
    bool transparent_bg,
    bool show_scrollbar,
    bool enable_scrolling,
    const lv_font_t * font,
    lv_text_align_t text_align
    );

keyboard_t create_keyboard(
    lv_obj_t * scr,
    int32_t size_w_px,
    int32_t size_h_px,
    lv_align_t alignment,
    int32_t pos_x,
    int32_t pos_y,
    int32_t kb_ta_padding_px,
    int32_t ta_height_px,
    lv_keyboard_mode_t keyboard_mode
    );

void create_menu_item(
    menu_struct * menu,
    int page_index,
    const char * title
    );

lv_obj_t * create_menu_page(
    lv_obj_t * menu_x,
    const char * title
    );

menu_struct create_menu(
    lv_obj_t *scr,
    int max_pages,
    const char ** page_titles,
    const char ** main_menu_items,
    int32_t size_w_px,
    int32_t size_h_px,
    lv_align_t alignment,
    int32_t pos_x,
    int32_t pos_y
    );

lv_obj_t * create_menu_grid(
    lv_obj_t *scr,
    const int32_t cols,
    const int32_t rows,
    const int32_t cell_size_px,
    const int32_t outer_padding,
    const int32_t inner_padding,
    const int32_t pos_x,
    const int32_t pos_y,
    lv_align_t lv_alignment,
    int32_t item_radius,
    int32_t max_cols_visible,
    int32_t max_rows_visible,
    bool show_scrollbar,
    bool enable_scrolling,
    lv_text_align_t text_align,
    const lv_font_t * font,
    bool transparent_bg,
    bool transparent_outline
    ) ;

lv_obj_t * create_dropdown_menu(
    lv_obj_t * scr,
    char options[][MAX_GLOBAL_ELEMENT_SIZE],
    int option_count,
    int32_t width_px,
    int32_t height_px,
    lv_align_t alignment,
    int32_t pos_x,
    int32_t pos_y,
    const lv_font_t * font
    );

lv_obj_t * create_switch(
    lv_obj_t *scr,
    int32_t size_w_px,
    int32_t size_h_px,
    lv_align_t alignment,
    int32_t pos_x,
    int32_t pos_y
    );

button_t create_button(
    lv_obj_t *scr,
    int32_t size_w_px,
    int32_t size_h_px,
    lv_align_t alignment,
    int32_t pos_x,
    int32_t pos_y,
    char * text,
    lv_text_align_t text_align,
    bool show_scrollbar,
    bool enable_scrolling,
    const lv_font_t * font,
    int32_t radius
    );

matrix_function_container_t create_matrix_function_container(
    lv_obj_t * scr,
    int32_t width_px,
    int32_t height_px,
    lv_align_t alignment,
    int32_t pos_x,
    int32_t pos_y,
    int32_t radius,
    bool show_scrollbar,
    bool enable_scrolling,
    const lv_font_t * font_title,
    const lv_font_t * font_sub
    );

