holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.h
mapping_config_container_t create_mapping_config_container(
    lv_obj_t * scr,
    int32_t width_px,
    int32_t height_px,
    int32_t alignment,
    int32_t pos_x,
    int32_t pos_y,
    int32_t radius,
    int32_t padding,
    int32_t row_height,
    int32_t row_spacing,
    bool show_scrollbar,
    bool enable_scrolling,
    const lv_font_t * font_title,
    const lv_font_t * font_sub
    );

sdcard_image_t * create_image_from_sdcard(
    lv_obj_t * scr,
    const char * filename,
    uint32_t width_px,
    uint32_t height_px,
    uint32_t color_depth_bits,
    uint32_t pos_x,
    uint32_t pos_y,
    lv_align_t alignment,
    bool discard_after_display
    );

void create_default_screen_objects(
    lv_obj_t * scr
    );

void cleanup_loading_image();

void setColorsDefault();
void setColorsCustom();

void display_loading_screen();
void display_home_screen();
void display_matrix_screen();
void display_gps_screen();
void display_gyro_screen();
void display_disp_screen();
void display_system_screen();
void display_uap_screen();

extern bool flag_display_loading_screen;
extern bool flag_display_home_screen;
extern bool flag_display_matrix_screen;
extern bool flag_display_gps_screen;
extern bool flag_display_gyro_screen;
extern bool flag_display_disp_screen;
extern bool flag_display_system_screen;
extern bool flag_display_uap_screen;

void update_display();
void update_display_on_timer(
    lv_timer_t * timer
    );

void initSatIOUI();
void satio_ui_begin();

#endif // SATIO_LVGL_H